In [1]:
import pandas as pd

In [3]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series: \n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
# Series with dictionary 
data = {'a':1, 'b':2, 'c':3}
dict_series = pd.Series(data)
print('Series: \n', dict_series)
print(type(dict_series))

Series:
 a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
# Creating a data frame from dictionary 

data = {
    'Name': ['John', 'Jack', 'Doe'],
    'Age': [20, 21, 22],
    'City': ['NY','California','Texas']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age        City
0  John   20          NY
1  Jack   21  California
2   Doe   22       Texas
<class 'pandas.core.frame.DataFrame'>

In [15]:
# Creating a data fram from a list of dictionaries 

data = [
    {'Name': 'John', 'Age': 20, 'City':'NY'},
    {'Name': 'Jack', 'Age': 21, 'City':'Bali'},
    {'Name': 'Doe', 'Age': 22, 'City':'Texas'},
]

df = pd.DataFrame(data)
print(df)

   Name  Age   City
0  John   20     NY
1  Jack   21   Bali
2   Doe   22  Texas

In [33]:
df = pd.read_csv('laptop.csv')
df.head(5)   #to see first 5 records

,Customer_ID,Age,Gender,City,Income_Level,Purchase_Mode,Brand_Purchased,Price_Range,Payment_Mode,Purchase_Frequency,Satisfaction_Rating
0,CUST00001,56,Male,Pune,Low,Online,Dell,30K-50K,UPI,Rare,4
1,CUST00002,46,Female,Kolkata,Medium,Online,MSI,Below 30K,Cash,Occasional,2
2,CUST00003,32,Male,Bangalore,Low,Online,Samsung,80K-1.2L,UPI,Occasional,3
3,CUST00004,25,Female,Jaipur,Medium,Offline,Samsung,Below 30K,Credit Card,Rare,4
4,CUST00005,38,Female,Pune,High,Online,MSI,80K-1.2L,Cash,Rare,3

In [13]:
df.tail(5)    #to see last 5 records

,Customer_ID,Age,Gender,City,Income_Level,Purchase_Mode,Brand_Purchased,Price_Range,Payment_Mode,Purchase_Frequency,Satisfaction_Rating
4995,CUST04996,32,Male,Pune,Low,Online,Apple,Below 30K,Credit Card,Rare,4
4996,CUST04997,36,Male,Delhi,Medium,Offline,Dell,50K-80K,Cash,Occasional,3
4997,CUST04998,52,Female,Chennai,Low,Online,Lenovo,80K-1.2L,Cash,Rare,2
4998,CUST04999,34,Male,Hyderabad,Medium,Online,Apple,30K-50K,UPI,Occasional,5
4999,CUST05000,52,Male,Kolkata,High,Online,Acer,30K-50K,Credit Card,Rare,3

In [17]:
# Accessing data from data frame 
df['Name']

0    John
1    Jack
2     Doe
Name: Name, dtype: object

In [18]:
df.loc[0]

Name    John
Age       20
City      NY
Name: 0, dtype: object

In [19]:
# Index location 
df.iloc[0]

Name    John
Age       20
City      NY
Name: 0, dtype: object

In [20]:
df.iloc[0][0]

C:\Users\Turan\AppData\Local\Temp\ipykernel_2020\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'John'

In [21]:
df

   Name  Age   City
0  John   20     NY
1  Jack   21   Bali
2   Doe   22  Texas

In [ ]:
# Accessing a specific element 
print(df.at[1,'Age'])

21

In [24]:
# Accessing element using iat 
print(df.iat[2,2])

Texas

In [25]:
df

   Name  Age   City
0  John   20     NY
1  Jack   21   Bali
2   Doe   22  Texas

In [26]:
# Data manipulation with data frames 
# Adding a column
df['Salary'] = [100000, 150000, 120000]

In [27]:
df

   Name  Age   City  Salary
0  John   20     NY  100000
1  Jack   21   Bali  150000
2   Doe   22  Texas  120000

In [ ]:
# Remove a column temporarily
df.drop('Salary', axis=1)

   Name  Age   City
0  John   20     NY
1  Jack   21   Bali
2   Doe   22  Texas

In [30]:
# Remove a column properly 
df.drop('Salary', axis=1,inplace=True)

In [31]:
df

   Name  Age   City
0  John   20     NY
1  Jack   21   Bali
2   Doe   22  Texas

In [32]:
# Increasing age of all column 
df['Age'] = df['Age'] + 1
df

   Name  Age   City
0  John   21     NY
1  Jack   22   Bali
2   Doe   23  Texas

In [36]:
# Describe
df.describe()

               Age  Satisfaction_Rating
count  5000.000000          5000.000000
mean     38.662200             2.994200
std      12.028492             1.416957
min      18.000000             1.000000
25%      28.000000             2.000000
50%      39.000000             3.000000
75%      49.000000             4.000000
max      59.000000             5.000000

In [38]:
df.dtypes

Customer_ID            object
Age                     int64
Gender                 object
City                   object
Income_Level           object
Purchase_Mode          object
Brand_Purchased        object
Price_Range            object
Payment_Mode           object
Purchase_Frequency     object
Satisfaction_Rating     int64
dtype: object